Repository: MarioIbrahem1/Zez
Catalog: lib/l10n/app_*.arb
Languages: ar

# privacyUserRightsTitle
source: 5. Your Rights & Controls
ar: 5. حقوقك والتحكم

# privacyDataControlTitle
source: Data Control Options
ar: خيارات التحكم في البيانات

# privacyDataControlContent
source: You have full control over your data: • Edit or update profile information anytime • Enable/disable location tracking (Google users) • Control visibility to other users • Clear chat history and cached data • Export emergency contact settings • Delete account and all associated data
ar: لديك تحكم كامل في بياناتك: • تعديل أو تحديث معلومات الملف الشخصي في أي وقت • تفعيل/تعطيل تتبع الموقع (مستخدمو جوجل) • التحكم في الظهور للمستخدمين الآخرين • مسح تاريخ الدردشة والبيانات المخزنة مؤقتاً • تصدير إعدادات جهات اتصال الطوارئ • حذف الحساب وجميع البيانات المرتبطة

# privacyAccessRightsTitle
source: Access & Deletion Rights
ar: حقوق الوصول والحذف

# privacyAccessRightsContent
source: You can request: • Access to all data we have about you • Correction of inaccurate information • Deletion of your account and all data • Data portability (export your information) • Restriction of data processing To exercise these rights, contact us at roadhelper200@gmail.com
ar: يمكنك طلب: • الوصول لجميع البيانات التي لدينا عنك • تصحيح المعلومات غير الدقيقة • حذف حسابك وجميع البيانات • قابلية نقل البيانات (تصدير معلوماتك) • تقييد معالجة البيانات لممارسة هذه الحقوق، اتصل بنا على roadhelper200@gmail.com

# privacyAuthMethodsTitle
source: 6. Authentication Methods
ar: 6. طرق المصادقة

# privacyTraditionalAuthTitle
source: Traditional Authentication
ar: المصادقة التقليدية

# privacyTraditionalAuthContent
source: Email/password authentication with OTP verification: • Email and encrypted password stored securely • OTP codes sent via email for verification • Session tokens for secure app access • Limited to basic app features and emergency services
ar: مصادقة البريد الإلكتروني/كلمة المرور مع التحقق برمز OTP: • البريد الإلكتروني وكلمة المرور المشفرة تُحفظ بأمان • رموز OTP تُرسل عبر البريد الإلكتروني للتحقق • رموز الجلسة للوصول الآمن للتطبيق • محدود بميزات التطبيق الأساسية وخدمات الطوارئ

# privacyGoogleAuthTitle
source: Google Sign-In Authentication
ar: مصادقة تسجيل الدخول بجوجل

# privacyGoogleAuthContent
source: Enhanced features with Google account integration: • Google account information (name, email, profile picture) • Access to additional features (help requests, real-time tracking) • License verification during signup • Seamless integration with Google services • Data governed by both our policy and Google's Privacy Policy
ar: ميزات محسنة مع تكامل حساب جوجل: • معلومات حساب جوجل (الاسم والبريد الإلكتروني وصورة الملف الشخصي) • الوصول لميزات إضافية (طلبات المساعدة والتتبع الفوري) • التحقق من الرخصة أثناء التسجيل • التكامل السلس مع خدمات جوجل • البيانات تحكمها سياستنا وسياسة خصوصية جوجل

# privacyDataRetentionTitle
source: 7. Data Retention
ar: 7. الاحتفاظ بالبيانات

# privacyRetentionPolicyTitle
source: Retention Policy
ar: سياسة الاحتفاظ

# privacyRetentionPolicyContent
source: We retain your data as follows: • Active account data: Retained while your account is active • Cached data: Automatically cleared when you log out • Emergency contacts: Retained until manually deleted • Chat history: Can be cleared by user anytime • Location data: Not permanently stored, used only for real-time features • Deleted accounts: All data permanently removed within 30 days
ar: نحتفظ ببياناتك كما يلي: • بيانات الحساب النشط: تُحفظ طالما حسابك نشط • البيانات المخزنة مؤقتاً: تُمسح تلقائياً عند تسجيل الخروج • جهات اتصال الطوارئ: تُحفظ حتى الحذف اليدوي • تاريخ الدردشة: يمكن مسحه من قبل المستخدم في أي وقت • بيانات الموقع: لا تُحفظ بشكل دائم، تُستخدم فقط للميزات الفورية • الحسابات المحذوفة: جميع البيانات تُحذف نهائياً خلال 30 يوماً

# privacySecurityMeasuresTitle
source: 8. Security Measures
ar: 8. إجراءات الأمان

# privacySecurityContent
source: We implement multiple security layers: • End-to-end encryption for data transmission • Secure token-based authentication • Local data encryption on your device • Regular security updates and patches • Firebase security rules for database access • No storage of sensitive data on external servers • Emergency data processed locally for maximum security
ar: نطبق طبقات أمان متعددة: • التشفير من النهاية للنهاية لنقل البيانات • المصادقة الآمنة المبنية على الرموز • تشفير البيانات المحلية على جهازك • تحديثات وإصلاحات أمنية منتظمة • قواعد أمان Firebase للوصول لقاعدة البيانات • عدم تخزين البيانات الحساسة على خوادم خارجية • بيانات الطوارئ تُعالج محلياً للحد الأقصى من الأمان

# privacyChildrenTitle
source: 9. Children's Privacy
ar: 9. خصوصية الأطفال

# privacyChildrenContent
source: Road Helper is intended for users 18 years and older. We do not knowingly collect personal information from children under 18. If you believe a child has provided us with personal information, please contact us immediately at roadhelper200@gmail.com and we will delete such information.
ar: تطبيق Road Helper مخصص للمستخدمين من عمر 18 سنة فما فوق. نحن لا نجمع معلومات شخصية من الأطفال تحت سن 18 عن علم. إذا كنت تعتقد أن طفلاً قدم لنا معلومات شخصية، يرجى الاتصال بنا فوراً على roadhelper200@gmail.com وسنحذف هذه المعلومات.

# privacyChangesTitle
source: 10. Policy Changes
ar: 10. تغييرات السياسة

# privacyChangesContent
source: We may update this Privacy Policy periodically to reflect changes in our practices or legal requirements. When we make significant changes: • We will notify users through the app • The updated policy will be posted with a new 'Last Updated' date • Continued use of the app constitutes acceptance of the updated policy • Major changes will require explicit user consent
ar: قد نحدث سياسة الخصوصية هذه دورياً لتعكس التغييرات في ممارساتنا أو المتطلبات القانونية. عندما نجري تغييرات مهمة: • سنخطر المستخدمين عبر التطبيق • السياسة المحدثة ستُنشر مع تاريخ 'آخر تحديث' جديد • الاستمرار في استخدام التطبيق يشكل قبولاً للسياسة المحدثة • التغييرات الكبيرة ستتطلب موافقة صريحة من المستخدم

# privacyContactTitle
source: 11. Contact Information
ar: 11. معلومات الاتصال

# privacyContactContent
source: For privacy-related questions, concerns, or requests: Email: roadhelper200@gmail.com Subject: Privacy Policy Inquiry We will respond to privacy inquiries within 48 hours and data requests within 30 days as required by applicable privacy laws.
ar: للأسئلة أو المخاوف أو الطلبات المتعلقة بالخصوصية: البريد الإلكتروني: roadhelper200@gmail.com الموضوع: استفسار سياسة الخصوصية سنرد على استفسارات الخصوصية خلال 48 ساعة وطلبات البيانات خلال 30 يوماً كما تتطلب قوانين الخصوصية المعمول بها.

# privacyConsentTitle
source: 12. Consent
ar: 12. الموافقة

# privacyConsentContent
source: By using Road Helper, you consent to: • Collection and use of your information as described in this policy • Processing of your data for app functionality and safety features • Storage of emergency contact information for SOS services • Use of location services for navigation and help requests (when enabled) You can withdraw consent at any time by deleting your account or contacting us.
ar: باستخدام Road Helper، أنت توافق على: • جمع واستخدام معلوماتك كما هو موضح في هذه السياسة • معالجة بياناتك لوظائف التطبيق وميزات السلامة • تخزين معلومات جهات اتصال الطوارئ لخدمات SOS • استخدام خدمات الموقع للملاحة وطلبات المساعدة (عند التفعيل) يمكنك سحب الموافقة في أي وقت بحذف حسابك أو الاتصال بنا.

source: Checking SOS permissions...
ar: جاري فحص أذونات SOS...

source: SOS Fully Enabled
ar: SOS مُفعل بالكامل

source: SOS Partially Enabled
ar: SOS مُفعل جزئياً

source: SOS Disabled
ar: SOS معطل

# allRequiredPermissionsGranted
source: All required permissions are granted. SOS emergency feature is ready to use.
ar: تم منح جميع الأذونات المطلوبة. ميزة الطوارئ SOS جاهزة للاستخدام.

# somePermissionsMissing
source: Some permissions are missing. SOS functionality may be limited.
ar: بعض الأذونات مفقودة. قد تكون وظائف SOS محدودة.

# sosPermissionsNotGranted
source: SOS permissions are not granted. Emergency features will not work.
ar: لم يتم منح أذونات SOS. ميزات الطوارئ لن تعمل.

source: Permission Details:
ar: تفاصيل الأذونات:

source: Refresh Status
ar: تحديث الحالة

source: Grant Missing Permissions
ar: منح الأذونات المفقودة

source: Enable SOS Permissions
ar: تفعيل أذونات SOS

source: All SOS permissions granted successfully!
ar: تم منح جميع أذونات SOS بنجاح!

# errorRequestingPermissions
source: Error requesting permissions. Please try again.
ar: خطأ في طلب الأذونات. يرجى المحاولة مرة أخرى.

# phonePermission
source: Phone
ar: الهاتف

# smsPermission
source: SMS
ar: الرسائل النصية

# locationPermission
source: Location
ar: الموقع

# contactsPermission
source: Contacts
ar: جهات الاتصال

# notificationPermission
source: Notifications
ar: الإشعارات

source: Granted
ar: مُمنوح

source: Denied
ar: مرفوض

source: SOS Emergency Permissions
ar: أذونات الطوارئ SOS

# sosEmergencyFeatureRequiresPermissions
source: The SOS emergency feature requires several permissions to function properly and help you in emergency situations.
ar: ميزة الطوارئ SOS تتطلب عدة أذونات للعمل بشكل صحيح ومساعدتك في حالات الطوارئ.

# thesePermissionsAllowAppTo
source: These permissions allow the app to:
ar: هذه الأذونات تسمح للتطبيق بـ:

# makeEmergencyCallsToContacts
source: Make emergency calls to your contacts
ar: إجراء مكالمات طوارئ لجهات الاتصال الخاصة بك

# sendEmergencySMSWithLocation
source: Send emergency SMS with your location
ar: إرسال رسائل SMS طوارئ مع موقعك

# accessLocationForRescue
source: Access your location for rescue
ar: الوصول لموقعك للإنقاذ

source: Send emergency notifications
ar: إرسال إشعارات الطوارئ

# continueButton
source: Continue
ar: متابعة

source: What SOS Can Do
ar: ما يمكن لـ SOS فعله

source: Emergency Calls
ar: مكالمات الطوارئ

# automaticallyCallEmergencyContacts
source: Automatically call your emergency contacts
ar: الاتصال تلقائياً بجهات اتصال الطوارئ

source: Location SMS
ar: رسائل الموقع

# sendExactLocationViaSMS
source: Send your exact location via SMS
ar: إرسال موقعك الدقيق عبر الرسائل النصية

source: Access your location
ar: الوصول لموقعك

# phonePermissionTitle
source: Phone Permission
ar: إذن الهاتف

# phonePermissionDescription
source: Allow the app to make emergency phone calls to your emergency contacts when SOS is triggered.
ar: السماح للتطبيق بإجراء مكالمات هاتف طوارئ لجهات اتصال الطوارئ عند تشغيل SOS.

# phonePermissionUsage
source: Used only during emergency situations to call for help.
ar: يُستخدم فقط في حالات الطوارئ للاتصال طلباً للمساعدة.

# smsPermissionTitle
source: SMS Permission
ar: إذن الرسائل النصية

# smsPermissionDescription
source: Allow the app to send emergency SMS messages with your location to your emergency contacts.
ar: السماح للتطبيق بإرسال رسائل SMS طوارئ مع موقعك لجهات اتصال الطوارئ.

# smsPermissionUsage
source: Used only during emergencies to send your location and alert message.
ar: يُستخدم فقط في حالات الطوارئ لإرسال موقعك ورسالة التنبيه.

# locationPermissionTitle
source: Location Permission
ar: إذن الموقع

# locationPermissionDescription
source: Allow the app to access your current location to include in emergency messages.
ar: السماح للتطبيق بالوصول لموقعك الحالي لتضمينه في رسائل الطوارئ.

# locationPermissionUsage
source: Used only during emergencies to share your location with helpers.
ar: يُستخدم فقط في حالات الطوارئ لمشاركة موقعك مع المساعدين.

# contactsPermissionTitle
source: Contacts Permission
ar: إذن جهات الاتصال

# contactsPermissionDescription
source: Allow the app to access your saved emergency contacts to call them.
ar: السماح للتطبيق بالوصول لجهات اتصال الطوارئ المحفوظة للاتصال بها.

# contactsPermissionUsage
source: Used only to access your pre-defined emergency contacts.
ar: يُستخدم فقط للوصول لجهات اتصال الطوارئ المحددة مسبقاً.

# notificationPermissionTitle
source: Notification Permission
ar: إذن الإشعارات

# notificationPermissionDescription
source: Allow the app to show critical emergency notifications and SOS status updates.
ar: السماح للتطبيق بإظهار إشعارات الطوارئ الحرجة وتحديثات حالة SOS.

# notificationPermissionUsage
source: Used to show emergency alerts and SOS service status.
ar: يُستخدم لإظهار تنبيهات الطوارئ وحالة خدمة SOS.

source: Grant Permission
ar: منح الإذن

source: Skip
ar: تخطي

# usedOnlyDuringEmergencies
source: Used only during emergency situations to call for help
ar: يُستخدم فقط أثناء حالات الطوارئ للاتصال طلباً للمساعدة

source: Permission Required
ar: إذن مطلوب

# permissionRequiredDescription
source: This permission is required for SOS emergency functionality.
ar: هذا الإذن مطلوب لوظيفة الطوارئ SOS.

source: Permission Needed
ar: إذن مطلوب

# isRequiredForSOSFunctionality
source: is required for SOS emergency functionality. Without this permission, the SOS feature may not work properly in emergency situations.
ar: مطلوب لوظيفة الطوارئ SOS. بدون هذا الإذن، قد لا تعمل ميزة SOS بشكل صحيح في حالات الطوارئ.

# hasBeenPermanentlyDenied
source: has been permanently denied. To enable SOS emergency functionality, please:
ar: تم رفضه نهائياً. لتفعيل وظيفة الطوارئ SOS، يرجى:

# tapOpenSettingsBelow
source: 1. Tap "Open Settings" below
ar: 1. انقر على "فتح الإعدادات" أدناه

# findRoadHelperInAppList
source: 2. Find "Road Helper" in the app list
ar: 2. ابحث عن "Road Helper" في قائمة التطبيقات

# tapPermissions
source: 3. Tap "Permissions"
ar: 3. انقر على "الأذونات"

# enableRequiredPermission
source: 4. Enable the required permission
ar: 4. فعّل الإذن المطلوب

# returnToApp
source: 5. Return to the app
ar: 5. ارجع إلى التطبيق
