Repository: MarioIbrahem1/Zez
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Welcome back!
ar: مرحبًا بعودتك!

source: Enter your email
ar: أدخل بريدك الإلكتروني

source: Email
ar: البريد الإلكتروني

source: Please enter your email
ar: يرجى إدخال بريدك الإلكتروني

source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صحيح

source: Enter your password
ar: أدخل كلمة المرور

source: Password
ar: كلمة المرور

source: Please enter your password
ar: يرجى إدخال كلمة المرور

source: Password must be at least 6 characters
ar: يجب أن تتكون كلمة المرور من 6 أحرف على الأقل

source: Remember me
ar: تذكرني

source: Forgot password?
ar: هل نسيت كلمة المرور؟

source: Login
ar: تسجيل الدخول

source: Don't have an account?
ar: ليس لديك حساب؟

# register
source: Register now
ar: سجل الآن

source: Edit profile
ar: تعديل الملف الشخصي

source: Language
ar: اللغة

source: Dark mode
ar: الوضع الليلي

source: About
ar: حول

source: Logout
ar: تسجيل الخروج

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Change profile image
ar: تغيير صورة الملف الشخصي

source: OTP Verification
ar: التحقق من الرمز

# enterOtpSentToEmail
source: Enter the code sent to {email}
ar: تم إرسال رمز التحقق إلى {email}

# resendOtp
source: Resend code
ar: إعادة إرسال الرمز

# resendInSecondsSec
source: Resend in {seconds} seconds
ar: إعادة الإرسال خلال {seconds} ثانية

source: Timer
ar: المؤقت

source: We have sent a verification code to the email "A**@gmail.com"
ar: لقد أرسلنا رمز تحقق إلى البريد الإلكتروني "A**@gmail.com"

source: This is a temporary code, do not share it with anyone. Sharing the OTP with others can lead to significant security risks. The OTP is intended to be a private code.
ar: هذا رمز مؤقت، لا تشاركه مع أي شخص. مشاركة الرمز قد تؤدي إلى مخاطر أمنية كبيرة. الرمز مخصص للاستخدام الخاص فقط.

source: Notifications
ar: الإشعارات

source: Privacy
ar: الخصوصية

source: Security
ar: الأمان

source: Help
ar: المساعدة

source: Terms and conditions
ar: الشروط والأحكام

source: Contact us
ar: اتصل بنا

# otpVerificationText
source: We have sent a verification code to the email "A**@gmail.com"
ar: لقد أرسلنا رمز تحقق إلى البريد الإلكتروني "A**@gmail.com"

# otpAllFieldsRequired
source: All fields are required
ar: يجب تعبئة جميع الحقول

source: Verify
ar: تحقق

source: Enter code
ar: أدخل الرمز

source: Get started
ar: ابدأ الآن

source: If you've got the time, we've got the shine
ar: إذا كان لديك الوقت، فنحن لدينا التألق

source: Just the protection you and your car need Speak to us for best services
ar: الحماية المثالية لك وللسيارة تحدث معنا لأفضل الخدمات

source: Sign Up
ar: إنشاء حساب

source: Sign In
ar: تسجيل الدخول

source: Location required
ar: الموقع مطلوب

source: Please enable location services to continue.
ar: يرجى تفعيل خدمات الموقع للاستمرار.

source: OK
ar: حسنًا

source: Emergency contacts
ar: جهات الاتصال في الطوارئ

source: Enter emergency phone number
ar: أدخل رقم الهاتف للطوارئ

# example
source: Example: 1234567890
ar: مثال: 1234567890

source: Add contact
ar: إضافة جهة اتصال

# addedContacts
source: View added contacts
ar: عرض جهات الاتصال المضافة

source: Delete contact
ar: حذف جهة الاتصال

# weWillSendYouAnOneTimePasswordOnYourEmailAddress
source: We will send you a one-time password on your email address
ar: سنرسل لك كلمة مرور لمرة واحدة على بريدك الإلكتروني

# getOtp
source: Get code
ar: احصل على الرمز

source: Please enter a valid email address
ar: يرجى إدخال بريد إلكتروني صالح

source: Invalid email
ar: البريد الإلكتروني غير صالح

# dontHaveAnAccountRegister
source: Don't have an account? Register now
ar: ليس لديك حساب؟ سجل الآن

source: Full name
ar: الاسم الكامل

source: Phone number
ar: رقم الهاتف

source: Confirm password
ar: تأكيد كلمة المرور

source: Username
ar: اسم المستخدم

source: First Name
ar: الاسم الأول

source: Last name
ar: الاسم الأخير

source: Car settings
ar: إعدادات السيارة

source: Car number
ar: رقم السيارة

source: Car color
ar: لون السيارة

# carKind
source: Car type
ar: نوع السيارة

source: Update changes
ar: تحديث التغييرات

source: Primary gradient
ar: التدرج الأساسي

source: Primary blue
ar: الأزرق الأساسي

source: White
ar: أبيض

source: Error red
ar: أحمر خطأ

source: Success green
ar: أخضر نجاح

source: Button color
ar: لون الزر

source: OTP length
ar: طول الرمز

source: OTP timeout
ar: مهلة الرمز

source: Car number type
ar: نوع رقم السيارة

source: Numbers only
ar: أرقام فقط

source: Letters and numbers
ar: حروف وأرقام

source: Enter plate number
ar: أدخل رقم اللوحة

source: Please enter numbers
ar: يرجى إدخال الأرقام

source: Must be at least 1 number and max 7 digits
ar: يجب أن يكون على الأقل 1 رقم وبحد أقصى 7 أرقام

source: Letters
ar: حروف

source: Plate numbers
ar: أرقام اللوحات

source: Required
ar: مطلوب

source: Enter car color
ar: أدخل لون السيارة

source: Please enter car color
ar: يرجى إدخال لون السيارة

source: Car model
ar: موديل السيارة

source: Enter car model
ar: أدخل موديل السيارة

source: Please enter car model
ar: يرجى إدخال موديل السيارة

source: Welcome to your Smart Road Assistant
ar: مرحبًا بك في مساعدك الذكي على الطريق

source: Ask me anything about your car or road troubles and I'll help instantly
ar: اسألني أي شيء عن سيارتك أو مشاكل الطريق وسأساعدك على الفور

source: AI Chat
ar: الدردشة مع الذكاء الاصطناعي

source: Type here
ar: اكتب هنا

source: Smart Road Assistant
ar: مساعد الطريق الذكي

source: We help you with any road issues
ar: نساعدك في أي مشاكل على الطريق

source: Chat with AI
ar: الدردشة مع الذكاء الاصطناعي

source: Discover how the smart assistant can help
ar: اكتشف كيف يمكن للمساعد الذكي مساعدتك

source: Home
ar: الرئيسية

source: Map
ar: الخريطة

source: Chat
ar: الدردشة

# notificationsNav
source: Notifications
ar: الإشعارات

source: Profile
ar: الملف الشخصي

source: Camera
ar: الكاميرا

source: Send
ar: إرسال

source: Back
ar: عودة

# signUpButton
source: Sign Up
ar: التسجيل

source: Enter your full name
ar: أدخل اسمك الكامل

source: Enter your phone number
ar: أدخل رقم هاتفك

# pleaseEnterPhoneNumber
source: Please enter your phone number
ar: الرجاء إدخال رقم الهاتف

source: Already have an account?
ar: هل لديك حساب بالفعل ؟

# rememberFor30Days
source: Remember me for 30 days
ar: تذكرني لمدة 30 يوم

source: All fields must be filled out
ar: يجب تعبئة جميع الحقول

# otpVerificationTitle
source: OTP Verification
ar: التحقق من الرمز

source: New password
ar: كلمة المرور الجديدة

source: Rewrite new password
ar: أعد كتابة كلمة المرور الجديدة

# passwordMustHave
source: Password must contain:
ar: يجب أن تحتوي كلمة المرور على:

# oneCapitalLetterOrMore
source: At least one capital letter
ar: حرف كبير واحد على الأقل

# oneSpecialCharacterOrMore
source: At least one special character
ar: رمز خاص واحد على الأقل

# oneNumberOrMore
source: At least one number
ar: رقم واحد على الأقل

source: Passwords match
ar: كلمتا المرور متطابقتان

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Success!
ar: نجاح!

source: Password reset successfully
ar: تمت إعادة تعيين كلمة المرور بنجاح

source: Done
ar: تم

source: Providing the best AI solutions
ar: نقدم أفضل حلول الذكاء الاصطناعي

# readyToCheckCarRepairNeeds
source: Ready to check your car repair needs!
ar: جاهز لمعرفة ما تحتاجه سيارتك من إصلاحات!

# answerOfYourQuestions
source: Answers to your questions
ar: إجابات على أسئلتك

source: ( Just ask me anything you like )
ar: ( فقط اسألني أي شيء تريده )

source: Available for you all day
ar: متاح لك طوال اليوم

source: ( Feel free to ask anytime )
ar: ( لا تتردد في السؤال في أي وقت )

source: Ask me anything...
ar: اسألني أي شيء...

source: Your location: Egypt
ar: موقعك: مصر

# getYouBackOnTrack
source: Get you back on track with just a few taps
ar: نُعيدك للطريق ببضع نقرات فقط

source: Get your services
ar: احصل على خدماتك

source: Gas station
ar: محطة وقود

source: Police department
ar: قسم الشرطة

source: Fire extinguisher
ar: المطافي

source: Hospital
ar: مستشفى

source: Maintenance center
ar: مركز صيانة

source: Winch
ar: ونش

# notificationsTitle
source: Notifications
ar: الإشعارات

source: Clear all
ar: مسح الكل

source: No notifications
ar: لا توجد إشعارات

# notificationInboxEmpty
source: Notification inbox is empty
ar: صندوق الإشعارات فارغ

source: At least 3 characters
ar: على الأقل 3 أحرف

source: Phone
ar: رقم الهاتف

source: Password must be at least 8 characters
ar: يجب أن تتكون كلمة المرور من 8 أحرف على الأقل

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# forgotPasswordQuestion
source: Forgot your password?
ar: هل نسيت كلمة المرور؟

source: Must be exactly 11 digits
ar: يجب أن يكون 11 رقمًا بالضبط

source: or
ar: او

source: Next page
ar: الصفحة التالية

source: Profile screen
ar: شاشة الملف الشخصي

source: Warning
ar: تحذير

source: Please select between 1 to 3 services.
ar: يرجى اختيار من خدمة إلى ثلاث خدمات.

source: Location
ar: الموقع

source: Map screen
ar: شاشة الخريطة

source: Fetching location...
ar: جارٍ تحديد الموقع...

source: Please select at least one service!
ar: يرجى اختيار خدمة واحدة على الأقل!

source: About us
ar: معلومات عنا

source: Emergency services
ar: خدمات الطوارئ

# emergencyServicesDescription
source: Quickly locate nearby hospitals, police stations, and emergency contacts
ar: حدد بسرعة المستشفيات ومراكز الشرطة وجهات الاتصال في حالات الطوارئ القريبة

source: Gas stations
ar: محطات الوقود

source: Community help
ar: مساعدة المجتمع

source: About the app
ar: حول التطبيق

# gasStationsDescription
source: Find the nearest fuel stations with real-time availability information
ar: اعثر على أقرب محطة وقود مع معلومات التوفر في الوقت الفعلي

# communityHelpDescription
source: Request assistance from nearby users in case of emergencies
ar: اطلب المساعدة من المستخدمين القريبين في حالات الطوارئ

# missionDescription
source: Our mission is to make your journeys safer and more convenient through innovative technology solutions.
ar: مهمتنا هي جعل رحلاتك أكثر أمانًا وراحة من خلال حلول تقنية مبتكرة.

# technologyDescription
source: The app combines real-time location services with AI to provide intelligent assistance when you need it most
ar: يجمع التطبيق بين خدمات تحديد الموقع في الوقت الفعلي والذكاء الاصطناعي لتقديم المساعدة الذكية عند الحاجة.

# contactEmail
source: Contact: roadhelper200@gmail.com
ar: البريد الإلكتروني: roadhelper200@gmail.com

# missionAndTechnologyDescription
source: Our mission is to make your journeys safer and more convenient through innovative technology solutions. The app combines real-time location services with AI to provide intelligent assistance when you need it most.
ar: مهمتنا هي جعل رحلاتك أكثر أمانًا وراحة من خلال حلول تقنية مبتكرة. يجمع التطبيق بين خدمات تحديد الموقع في الوقت الفعلي والذكاء الاصطناعي لتقديم المساعدة الذكية عند الحاجة.

# versionLabel
source: Version:
ar: الإصدار:

# version
source: Version: 1.0.0
ar: الإصدار: 1.0.0

# developer
source: Developer: Smart Road Assistant Team
ar: المطور: فريق مساعد الطريق

# allRightsReserved
source: All rights reserved © 2025
ar: جميع الحقوق محفوظة © 2025

# passwordResetSuccessful
source: Your password has been reset successfully. You can now login with your new password
ar: تمت إعادة تعيين كلمة المرور بنجاح. يمكنك الآن تسجيل الدخول بكلمة المرور الجديدة

source: Continue to Login
ar: الانتقال إلى تسجيل الدخول

# loginSuccessful
source: You have successfully logged in to your account
ar: تم تسجيل الدخول إلى حسابك بنجاح

# registrationSuccessful
source: Your account has been created successfully. You can now login with your credentials
ar: تم إنشاء حسابك بنجاح. يمكنك الآن تسجيل الدخول باستخدام بيانات الاعتماد الخاصة بك

# passwordMismatch
source: The passwords you entered do not match. Please try again
ar: كلمتا المرور غير متطابقتين. يرجى المحاولة مرة أخرى

# invalidCredentials
source: The email or password you entered is incorrect. Please try again
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة. يرجى المحاولة مرة أخرى

# networkError
source: Please check your internet connection and try again
ar: يرجى التحقق من اتصال الإنترنت والمحاولة مرة أخرى

# serverError
source: Something went wrong with the server. Please try again later
ar: حدث خطأ في الخادم. يرجى المحاولة لاحقًا

source: Validation Error
ar: خطأ في التحقق

source: Error
ar: خطأ

source: Unknown Place
ar: مكان غير معروف

source: Directions
ar: الاتجاهات

source: Call
ar: اتصال

source: Share
ar: مشاركة

source: Try Again
ar: أعد المحاولة

# continueText
source: Continue
ar: متابعة

source: Error loading profile
ar: خطأ في تحميل الملف الشخصي

# couldNotLoadProfileImage
source: Could not load profile image. Please try again later
ar: تعذر تحميل صورة الملف الشخصي. يرجى المحاولة لاحقًا

source: Uploading image...
ar: جارٍ تحميل الصورة...

source: Gallery
ar: المعرض

# userEmailNotFound
source: User email not found. Please log in again
ar: لم يتم العثور على البريد الإلكتروني. يرجى تسجيل الدخول مرة أخرى

source: Error uploading image
ar: حدث خطأ أثناء تحميل الصورة

# profileImageUpdated
source: Profile image updated successfully
ar: تم تحديث صورة الملف الشخصي بنجاح

# failedToUploadImage
source: Failed to upload image. Please try again
ar: فشل تحميل الصورة. يرجى المحاولة مرة أخرى

# resendInSeconds
source: Resend in {timeLeft} seconds
ar: أعد الإرسال في {timeLeft} ثانية

source: Help Request
ar: طلب مساعدة

source: Accept
ar: قبول

source: Decline
ar: رفض

# youHaveReceivedHelpRequest
source: You have received a help request from:
ar: لقد تلقيت طلب مساعدة من:

source: Failed to respond to help request
ar: فشل في الاستجابة لطلب المساعدة

source: Distance
ar: المسافة

# kmAway
source: {distance} km away
ar: {distance} كم بعيداً

source: Name
ar: الاسم

source: Car
ar: السيارة

source: Color
ar: اللون

source: Message
ar: الرسالة

source: Update Available
ar: تحديث متاح

# updateAvailableMessage
source: Version {version} is now available. Tap to update.
ar: الإصدار {version} متاح الآن. انقر للتحديث.

source: New Notification
ar: إشعار جديد

source: OTP Sent
ar: تم إرسال رمز التحقق

# otpSentToEmail
source: OTP has been sent to your email
ar: تم إرسال رمز التحقق إلى بريدك الإلكتروني

source: Resend Code
ar: إعادة إرسال الرمز

source: OTP expired
ar: انتهت صلاحية رمز التحقق!

source: Request OTP
ar: طلب رمز تحقق جديد

source: Back to login
ar: العودة إلى تسجيل الدخول

source: The OTP has expired!
ar: انتهت صلاحية رمز التحقق!

source: Sign in with Google
ar: تسجيل الدخول باستخدام جوجل

source: Sign up with Google
ar: التسجيل باستخدام جوجل

source: Error in verification
ar: خطأ في التحقق

source: Please enter a 6-digit OTP code
ar: الرجاء إدخال رمز التحقق المكون من 6 أرقام

# emailAlreadyExists
source: This email is already associated with an existing account. Please login instead of signing up.
ar: هذا البريد الإلكتروني مرتبط بحساب موجود بالفعل. يرجى تسجيل الدخول بدلاً من التسجيل.

# licenseCaptureTitle
source: Driver's License Capture
ar: تصوير رخصة القيادة

# placeLicenseInFrameFront
source: Place the license in the frame and capture the front side
ar: ضع الرخصة في المربع وصور الوجه الأمامي

# flipLicenseAndCaptureBack
source: Flip the license and capture the back side
ar: اقلب الرخصة وصور الظهر

# placeLicenseInFrame
source: Place the driver's license in the frame
ar: ضع رخصة القيادة في الإطار

source: Front Side
ar: الوجه الأمامي

source: Back Side
ar: الظهر

# placeLicenseHereFront
source: Place driver's license here (Front Side)
ar: ضع رخصة القيادة هنا (الوجه الأمامي)

# placeLicenseHereBack
source: Place driver's license here (Back Side)
ar: ضع رخصة القيادة هنا (الظهر)

source: Preparing camera...
ar: جاري تحضير الكاميرا...

# captureError
source: Error capturing image
ar: خطأ في التقاط الصورة

# retakePhoto
source: Retake
ar: إعادة التقاط

source: Confirm
ar: تأكيد

# completed
source: Done
ar: تم

source: Flip to Back
ar: اقلب للظهر

source: Capture Front
ar: صور الوجه

source: Capture Back
ar: صور الظهر

source: Capturing...
ar: جاري التقاط...

source: Retake
ar: إعادة التقاط

# continueNext
source: Continue
ar: متابعة

# pleaseCaptureBothSides
source: Please capture both front and back of the license
ar: يرجى تصوير وجه وظهر الرخصة

source: Nearest Place
ar: أقرب مكان

source: Distance unknown
ar: المسافة غير معروفة

source: Time unknown
ar: الوقت غير معروف

source: Details
ar: التفاصيل

source: Hide Route
ar: إخفاء المسار

source: Show Route
ar: إظهار المسار

source: Alternative Routes
ar: مسارات بديلة

source: Navigation
ar: الملاحة

# meters
source: m
ar: م

# kilometers
source: km
ar: كم

# sosEmergencyConfiguration
source: Emergency SOS Configuration
ar: إعدادات الطوارئ SOS

# configureEmergencyAlerts
source: Configure how you want to trigger emergency alerts
ar: قم بتكوين كيفية تشغيل تنبيهات الطوارئ

source: SOS Service
ar: خدمة SOS

# enableDisableEmergencySOS
source: Enable/disable emergency SOS functionality
ar: تفعيل/إلغاء تفعيل وظيفة الطوارئ SOS

source: Power Button Trigger
ar: تشغيل زر الطاقة

# triplePowerButtonSOS
source: Triple press power button to send SOS
ar: اضغط على زر الطاقة ثلاث مرات لإرسال SOS

source: Manage Emergency Contacts
ar: إدارة جهات اتصال الطوارئ

source: How to use SOS:
ar: كيفية استخدام SOS:

# sosInstructions
source: • Triple press power button quickly to trigger SOS • Tap the emergency button on the home screen • Make sure to set up emergency contacts first
ar: • اضغط على زر الطاقة ثلاث مرات بسرعة لتشغيل SOS • انقر على زر الطوارئ في الشاشة الرئيسية • تأكد من إعداد جهات اتصال الطوارئ أولاً

source: Enable SOS Emergency Service
ar: تفعيل خدمة الطوارئ SOS

# enableAccessibilityServiceSOS
source: Enable accessibility service to use SOS power button trigger
ar: قم بتفعيل خدمة إمكانية الوصول لاستخدام تشغيل SOS بزر الطاقة

source: Emergency Contact Information
ar: معلومات جهة اتصال الطوارئ

source: Loading saved emergency contacts...
ar: جاري تحميل جهات اتصال الطوارئ المحفوظة...

# setupEmergencyContactsForSOS
source: Set up your emergency contacts for SOS alerts
ar: قم بإعداد جهات اتصال الطوارئ لتنبيهات SOS

# pleaseEnterFirstName
source: Please enter your first name
ar: يرجى إدخال اسمك الأول

# firstNameLettersOnly
source: First name should contain only letters
ar: يجب أن يحتوي الاسم الأول على أحرف فقط

# firstNameMinLength
source: First name should be at least 3 characters
ar: يجب أن يكون الاسم الأول 3 أحرف على الأقل

# firstNameMaxLength
source: First name should not exceed 13 characters
ar: يجب ألا يتجاوز الاسم الأول 13 حرفاً

source: Clear Emergency Data
ar: مسح بيانات الطوارئ

# clearEmergencyDataConfirmation
source: Are you sure you want to clear all saved emergency contact information? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد مسح جميع معلومات جهات اتصال الطوارئ المحفوظة؟ لا يمكن التراجع عن هذا الإجراء.

source: SOS Service Active
ar: خدمة SOS نشطة

# triplePressForEmergency
source: Triple press power button for emergency
ar: اضغط على زر الطاقة ثلاث مرات للطوارئ

# sosEmergencyMessage
source: SOS! {userName} needs help! Current coordinates: {latitude}, {longitude} Battery: {batteryLevel}% IMPORTANT: Copy the coordinates and put them in Google Maps to show the actual location.
ar: SOS! {userName} يحتاج المساعدة! الإحداثيات الحالية: {latitude}, {longitude} البطارية: {batteryLevel}% مهم: انسخ الإحداثيات وضعها في خرائط جوجل لإظهار الموقع الفعلي.

# failedToSendEmergencyAlert
source: Failed to send emergency alert. Please try again.
ar: فشل في إرسال تنبيه الطوارئ. يرجى المحاولة مرة أخرى.

# helpRequestServiceNotAvailable
source: Help Requests Service is available for only Google Users
ar: خدمة طلبات المساعدة غير متاحة إلا لمستخدمي جوجل فقط

# accessibilityInstructions
source: To enable SOS Emergency Service for power button detection: 1. Tap "Open Settings" below 2. Go to Android Settings → Accessibility 3. Look for "Installed Apps" or "Downloaded Apps" section 4. Find and select "Road Helper" 5. Toggle the service ON 6. Tap "Allow" in the popup dialog This allows the app to detect triple power button presses for emergency alerts.
ar: لتفعيل خدمة الطوارئ SOS لكشف زر الطاقة: 1. انقر على "فتح الإعدادات" أدناه 2. اذهب إلى إعدادات أندرويد ← إمكانية الوصول 3. ابحث عن قسم "التطبيقات المثبتة" أو "التطبيقات المحملة" 4. ابحث عن "Road Helper" وحدده 5. قم بتشغيل الخدمة 6. انقر على "السماح" في النافذة المنبثقة هذا يسمح للتطبيق بكشف الضغط ثلاث مرات على زر الطاقة لتنبيهات الطوارئ.

# accessibilityServiceRequired
source: This service is required for the SOS emergency feature to detect triple power button presses.
ar: هذه الخدمة مطلوبة لميزة الطوارئ SOS لكشف الضغط ثلاث مرات على زر الطاقة.

# lookForRoadHelperInAccessibility
source: Look for "Road Helper" in the accessibility services list and enable it.
ar: ابحث عن "Road Helper" في قائمة خدمات إمكانية الوصول وقم بتفعيله.

source: Follow these steps:
ar: اتبع هذه الخطوات:

# androidSettingsAccessibility
source: Go to Android Settings → Accessibility
ar: اذهب إلى إعدادات أندرويد ← إمكانية الوصول

source: Find "Installed Apps" section
ar: ابحث عن قسم "التطبيقات المثبتة"

source: Select "Road Helper"
ar: حدد "Road Helper"

# toggleServiceOn
source: Toggle the service ON
ar: قم بتشغيل الخدمة

source: Dismiss
ar: إلغاء

source: Open Settings
ar: فتح الإعدادات

# afterEnablingServiceReturn
source: After enabling the service, return to the app
ar: بعد تفعيل الخدمة، ارجع إلى التطبيق

source: Middle Name
ar: الاسم الأوسط

source: Age
ar: العمر

source: Emergency Contacts (Enter at least one)
ar: جهات الاتصال في الطوارئ (أدخل واحدة على الأقل)

source: Emergency Contact 1
ar: جهة الاتصال الطارئة 1

source: Emergency Contact 2
ar: جهة الاتصال الطارئة 2

source: Emergency Contact 3
ar: جهة الاتصال الطارئة 3

source: Save Emergency Information
ar: حفظ معلومات الطوارئ

source: Enable/Disable Emergency Function
ar: تفعيل/إلغاء تفعيل وظيفة الطوارئ

source: Enable Power Button Trigger
ar: تفعيل زر الطاقة

source: Press power button three times to send SOS
ar: اضغط على زر الطاقة ثلاث مرات لإرسال SOS

# accessibilityServiceNotEnabledMessage
source: Accessibility service is not enabled to use SOS power button trigger
ar: لم يتم تفعيل خدمة إمكانية الوصول لاستخدام تشغيل SOS بزر الطاقة

# followStepsToEnable
source: Follow these steps:
ar: اتبع هذه الخطوات:

source: Go to Android Settings → Accessibility
ar: اذهب إلى إعدادات أندرويد ← إمكانية الوصول

source: Look for "Installed Apps" section
ar: ابحث عن قسم "التطبيقات المثبتة"

# findRoadHelperAndSelect
source: Find and select "Road Helper"
ar: حدد "Road Helper"

# enableService
source: Enable the service
ar: قم بتشغيل الخدمة

source: Check Status
ar: فحص الحالة

# manageEmergencyContactsButton
source: Manage Emergency Contacts
ar: إدارة جهات اتصال الطوارئ

source: Personal Profile
ar: الملف الشخصي

source: Edit Personal Profile
ar: تعديل الملف الشخصي

source: Night Mode
ar: الوضع الليلي

# middleNameField
source: Middle Name
ar: الاسم الأوسط

# ageField
source: Age
ar: العمر

# emergencyContact1Field
source: Emergency Contact 1
ar: جهة الاتصال الطارئة 1

# emergencyContact2Field
source: Emergency Contact 2
ar: جهة الاتصال الطارئة 2

# emergencyContact3Field
source: Emergency Contact 3
ar: جهة الاتصال الطارئة 3

# saveEmergencyInformationButton
source: Save Emergency Information
ar: حفظ معلومات الطوارئ

# clearSavedDataButton
source: Clear Saved Data
ar: مسح البيانات المحفوظة

# pleaseEnterMiddleName
source: Please enter your middle name
ar: يرجى إدخال اسمك الأوسط

# middleNameLettersOnly
source: Middle name should contain only letters
ar: يجب أن يحتوي الاسم الأوسط على أحرف فقط

# middleNameMinLength
source: Middle name should be at least 3 characters
ar: يجب أن يكون الاسم الأوسط 3 أحرف على الأقل

# middleNameMaxLength
source: Middle name should not exceed 13 characters
ar: يجب ألا يتجاوز الاسم الأوسط 13 حرفاً

# pleaseEnterAge
source: Please enter your age
ar: يرجى إدخال عمرك

# pleaseEnterValidAge
source: Please enter a valid age
ar: يرجى إدخال عمر صحيح

# ageMustBeAtLeast18
source: Age must be at least 18 years old
ar: يجب أن يكون العمر 18 سنة على الأقل

# ageMustBeLessThan100
source: Age must be less than 100 years old
ar: يجب أن يكون العمر أقل من 100 سنة

source: Enter phone number
ar: أدخل رقم الهاتف
