Repository: MarioIbrahem1/Zez
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Please enter at least one emergency contact
ar: يرجى إدخال جهة اتصال طارئة واحدة على الأقل

# phoneNumberMustBe11Digits
source: Phone number must be exactly 11 digits
ar: يجب أن يكون رقم الهاتف 11 رقماً بالضبط

# phoneNumberMustStartWith
source: Phone number must start with 010, 011, 012, or 015
ar: يجب أن يبدأ رقم الهاتف بـ 010 أو 011 أو 012 أو 015

source: Cancel
ar: إلغاء

source: Clear
ar: مسح

source: SOS Settings
ar: إعدادات SOS

# emergencyContactMustBe11Digits
source: Emergency Contact {contactNumber} must be exactly 11 digits
ar: يجب أن تكون جهة الاتصال الطارئة {contactNumber} 11 رقماً بالضبط

# emergencyContactMustStartWith
source: Emergency Contact {contactNumber} must start with 010, 011, 012, or 015
ar: يجب أن تبدأ جهة الاتصال الطارئة {contactNumber} بـ 010 أو 011 أو 012 أو 015

# emergencyContactsMustBeDifferent
source: Emergency contacts must be different from each other
ar: يجب أن تكون جهات الاتصال الطارئة مختلفة عن بعضها البعض

# emergencyContactDataCleared
source: Emergency contact data cleared successfully
ar: تم مسح بيانات جهات الاتصال الطارئة بنجاح

# errorClearingData
source: Error clearing data: {error}
ar: خطأ في مسح البيانات: {error}

# emergencyInformationSavedSuccessfully
source: Emergency contact information saved successfully! Your data will be preserved for SOS alerts.
ar: تم حفظ معلومات جهات الاتصال الطارئة بنجاح! سيتم الاحتفاظ ببياناتك لتنبيهات SOS.

# errorSavingData
source: Error saving data: {error}
ar: خطأ في حفظ البيانات: {error}

# pleaseEnterLastName
source: Please enter your last name
ar: يرجى إدخال اسمك الأخير

# lastNameLettersOnly
source: Last name should contain only letters
ar: يجب أن يحتوي الاسم الأخير على أحرف فقط

# lastNameMinLength
source: Last name should be at least 3 characters
ar: يجب أن يكون الاسم الأخير 3 أحرف على الأقل

# lastNameMaxLength
source: Last name should not exceed 13 characters
ar: يجب ألا يتجاوز الاسم الأخير 13 حرفاً

# checkStatusButton
source: Check Status
ar: فحص الحالة

# openSettingsButton
source: Open Settings
ar: فتح الإعدادات

# afterEnablingServiceReturnToApp
source: After enabling the service, return to the app and check status
ar: بعد تفعيل الخدمة، ارجع إلى التطبيق وافحص الحالة

source: Location Tracking
ar: تتبع الموقع

# locationTrackingEnabled
source: Location tracking enabled. You are now visible to other users.
ar: تم تفعيل تتبع الموقع. أنت الآن مرئي للمستخدمين الآخرين.

# locationTrackingDisabled
source: Location tracking disabled. You are now hidden from other users.
ar: تم إيقاف تتبع الموقع. أنت الآن مخفي عن المستخدمين الآخرين.

# errorUpdatingLocationTracking
source: Error updating location tracking: {error}
ar: خطأ في تحديث تتبع الموقع: {error}

source: FAQ
ar: الأسئلة الشائعة

source: Frequently Asked Questions
ar: الأسئلة الشائعة

# faqAuthenticationTitle
source: Authentication & Account Management
ar: المصادقة وإدارة الحساب

# faqTraditionalVsGoogleTitle
source: What's the difference between traditional login and Google Sign-In?
ar: ما الفرق بين تسجيل الدخول التقليدي وتسجيل الدخول بجوجل؟

# faqTraditionalVsGoogleAnswer
source: Traditional login uses email/password with OTP verification for new users. Google Sign-In provides instant access with your Google account and includes additional features like real-time location tracking, help requests, and license upload during signup. Google users can see each other on the map and have access to the full help request system.
ar: تسجيل الدخول التقليدي يستخدم البريد الإلكتروني/كلمة المرور مع التحقق برمز OTP للمستخدمين الجدد. تسجيل الدخول بجوجل يوفر وصولاً فورياً بحساب جوجل الخاص بك ويتضمن ميزات إضافية مثل تتبع الموقع في الوقت الفعلي وطلبات المساعدة ورفع الرخصة أثناء التسجيل. مستخدمو جوجل يمكنهم رؤية بعضهم البعض على الخريطة ولديهم وصول كامل لنظام طلبات المساعدة.

# faqOtpProcessTitle
source: How does the OTP verification process work?
ar: كيف تعمل عملية التحقق برمز OTP؟

# faqOtpProcessAnswer
source: For new traditional users, after entering your email and password, you'll receive a 6-digit verification code via email. Enter this code within the time limit to complete registration. If the code expires, you can request a new one.
ar: للمستخدمين التقليديين الجدد، بعد إدخال بريدك الإلكتروني وكلمة المرور، ستتلقى رمز تحقق مكون من 6 أرقام عبر البريد الإلكتروني. أدخل هذا الرمز خلال الوقت المحدد لإكمال التسجيل. إذا انتهت صلاحية الرمز، يمكنك طلب رمز جديد.

# faqSessionManagementTitle
source: How does session management work?
ar: كيف تعمل إدارة الجلسة؟

# faqSessionManagementAnswer
source: The app saves your login token to keep you signed in. When you logout, all session data is cleared. For SOS emergency functionality, the app maintains persistent login to ensure emergency services remain available even if your session expires.
ar: التطبيق يحفظ رمز تسجيل الدخول الخاص بك للبقاء مسجلاً. عند تسجيل الخروج، يتم مسح جميع بيانات الجلسة. لوظيفة الطوارئ SOS، التطبيق يحافظ على تسجيل دخول مستمر لضمان بقاء خدمات الطوارئ متاحة حتى لو انتهت صلاحية جلستك.

# faqProfileManagementTitle
source: Profile & Vehicle Management
ar: إدارة الملف الشخصي والمركبة

# faqEditProfileTitle
source: How do I edit my profile information?
ar: كيف أقوم بتعديل معلومات ملفي الشخصي؟

# faqEditProfileAnswer
source: Go to Profile screen and tap 'Edit Profile'. You can update your name, phone number, car details (model, color, plate number), and profile image. Changes are saved automatically and cached for offline access.
ar: اذهب إلى شاشة الملف الشخصي وانقر على 'تعديل الملف الشخصي'. يمكنك تحديث اسمك ورقم هاتفك وتفاصيل السيارة (الموديل واللون ورقم اللوحة) وصورة الملف الشخصي. التغييرات تُحفظ تلقائياً ويتم تخزينها مؤقتاً للوصول دون اتصال.

# faqLicenseUploadTitle
source: How do I upload my driver's license?
ar: كيف أقوم برفع رخصة القيادة؟

# faqLicenseUploadAnswer
source: License upload is integrated with Google signup flow. During Google registration, you'll be prompted to capture both front and back images of your driver's license. This is required for Google users and happens automatically as part of the registration process.
ar: رفع الرخصة مدمج مع تدفق التسجيل بجوجل. أثناء التسجيل بجوجل، ستُطلب منك التقاط صور للوجه الأمامي والخلفي لرخصة القيادة. هذا مطلوب لمستخدمي جوجل ويحدث تلقائياً كجزء من عملية التسجيل.

# faqProfileImageTitle
source: What are the profile image specifications?
ar: ما هي مواصفات صورة الملف الشخصي؟

# faqProfileImageAnswer
source: Profile images should be square-shaped and match the profile container dimensions. Images are uploaded directly to the server and bypass local caching for real-time updates. You can change your profile image anytime from the Edit Profile screen.
ar: صور الملف الشخصي يجب أن تكون مربعة الشكل وتطابق أبعاد حاوية الملف الشخصي. الصور تُرفع مباشرة إلى الخادم وتتجاوز التخزين المؤقت المحلي للحصول على تحديثات فورية. يمكنك تغيير صورة ملفك الشخصي في أي وقت من شاشة تعديل الملف الشخصي.

# faqEmergencyFeaturesTitle
source: Emergency Features
ar: ميزات الطوارئ

# faqSosFunctionalityTitle
source: How does the SOS emergency feature work?
ar: كيف تعمل ميزة الطوارئ SOS؟

# faqSosFunctionalityAnswer
source: SOS can be triggered by pressing the power button 3 times quickly within 2 seconds. It automatically sends SMS messages with your location, battery level, and emergency details to your saved emergency contacts. The feature works offline and is available to both authentication types.
ar: يمكن تشغيل SOS بالضغط على زر الطاقة 3 مرات بسرعة خلال ثانيتين. يرسل تلقائياً رسائل SMS تحتوي على موقعك ومستوى البطارية وتفاصيل الطوارئ إلى جهات الاتصال الطارئة المحفوظة. الميزة تعمل دون اتصال بالإنترنت ومتاحة لكلا نوعي المصادقة.

# faqAccessibilityServiceTitle
source: How do I enable the accessibility service for SOS?
ar: كيف أقوم بتفعيل خدمة إمكانية الوصول لـ SOS؟

# faqAccessibilityServiceAnswer
source: Go to Android Settings > Accessibility > Installed Apps > Road Helper > Enable the service. This enhances power button detection for more reliable SOS triggering. You'll see step-by-step instructions when the service is disabled.
ar: اذهب إلى إعدادات أندرويد > إمكانية الوصول > التطبيقات المثبتة > Road Helper > فعّل الخدمة. هذا يحسن كشف زر الطاقة لتشغيل SOS أكثر موثوقية. ستظهر لك تعليمات خطوة بخطوة عندما تكون الخدمة معطلة.

# faqEmergencyContactsTitle
source: How do I manage emergency contacts?
ar: كيف أقوم بإدارة جهات اتصال الطوارئ؟

# faqEmergencyContactsAnswer
source: Go to Profile > Emergency Contacts to add your personal information and emergency contact details. Data is saved to Firebase and automatically retrieved on login regardless of authentication method. You need at least one emergency contact for SOS to work.
ar: اذهب إلى الملف الشخصي > جهات اتصال الطوارئ لإضافة معلوماتك الشخصية وتفاصيل جهات الاتصال الطارئة. البيانات تُحفظ في Firebase ويتم استردادها تلقائياً عند تسجيل الدخول بغض النظر عن طريقة المصادقة. تحتاج إلى جهة اتصال طارئة واحدة على الأقل لعمل SOS.

# faqHelpRequestsTitle
source: Help Requests
ar: طلبات المساعدة

# faqHelpRequestSystemTitle
source: How does the help request system work?
ar: كيف يعمل نظام طلبات المساعدة؟

# faqHelpRequestSystemAnswer
source: Help requests are exclusively available to Google-authenticated users only. You can request help from nearby Google users on the map. When help is accepted, complete contact details (name, phone, car details, distance) are displayed to both parties.
ar: طلبات المساعدة متاحة حصرياً لمستخدمي المصادقة بجوجل فقط. يمكنك طلب المساعدة من مستخدمي جوجل القريبين على الخريطة. عندما يتم قبول المساعدة، تُعرض تفاصيل الاتصال الكاملة (الاسم والهاتف وتفاصيل السيارة والمسافة) لكلا الطرفين.

# faqHelpRequestFlowTitle
source: What happens when I send or receive a help request?
ar: ماذا يحدث عندما أرسل أو أتلقى طلب مساعدة؟

# faqHelpRequestFlowAnswer
source: When you send a help request, nearby Google users receive a notification. If someone accepts, you both get each other's contact information and location. The system uses FCM push notifications to ensure real-time delivery between Google users.
ar: عندما ترسل طلب مساعدة، يتلقى مستخدمو جوجل القريبون إشعاراً. إذا قبل أحدهم، تحصلان كلاكما على معلومات الاتصال والموقع الخاصة ببعضكما البعض. النظام يستخدم إشعارات FCM push لضمان التسليم الفوري بين مستخدمي جوجل.

# faqMapLocationTitle
source: Map & Location Features
ar: ميزات الخريطة والموقع

# faqLocationTrackingTitle
source: How does real-time location tracking work?
ar: كيف يعمل تتبع الموقع في الوقت الفعلي؟

# faqLocationTrackingAnswer
source: Real-time location tracking is available only for Google-authenticated users. Your location is updated automatically and shared with other Google users on the map. You can toggle this feature on/off in your profile settings.
ar: تتبع الموقع في الوقت الفعلي متاح فقط لمستخدمي المصادقة بجوجل. موقعك يُحدث تلقائياً ويُشارك مع مستخدمي جوجل الآخرين على الخريطة. يمكنك تشغيل/إيقاف هذه الميزة في إعدادات ملفك الشخصي.

# faqNearbyServicesTitle
source: How do I find nearby services on the map?
ar: كيف أجد الخدمات القريبة على الخريطة؟

# faqNearbyServicesAnswer
source: The map shows nearby gas stations, hospitals, police stations, fire departments, maintenance centers, and winch services. You can filter by service type and get directions to the nearest location using Google Maps integration.
ar: الخريطة تُظهر محطات الوقود والمستشفيات ومراكز الشرطة وإدارات الإطفاء ومراكز الصيانة وخدمات الونش القريبة. يمكنك التصفية حسب نوع الخدمة والحصول على اتجاهات إلى أقرب موقع باستخدام تكامل خرائط جوجل.

# faqUserVisibilityTitle
source: How do I control my visibility to other users?
ar: كيف أتحكم في ظهوري للمستخدمين الآخرين؟

# faqUserVisibilityAnswer
source: Google users can toggle location tracking and user visibility in Profile settings. There's also a tracking disable toggle that prevents you from appearing as active or trackable to other users while maintaining your own access to the app.
ar: مستخدمو جوجل يمكنهم تبديل تتبع الموقع وظهور المستخدم في إعدادات الملف الشخصي. هناك أيضاً مفتاح تعطيل التتبع الذي يمنعك من الظهور كنشط أو قابل للتتبع للمستخدمين الآخرين مع الحفاظ على وصولك الخاص للتطبيق.

# faqNotificationsTitle
source: Notifications
ar: الإشعارات

# faqPushNotificationsTitle
source: How do push notifications work?
ar: كيف تعمل الإشعارات الفورية؟

# faqPushNotificationsAnswer
source: The app uses FCM (Firebase Cloud Messaging) for all notifications including help requests, chat messages, and map features. Notifications work for both authentication types and are displayed in the notifications page within the app.
ar: التطبيق يستخدم FCM (Firebase Cloud Messaging) لجميع الإشعارات بما في ذلك طلبات المساعدة ورسائل الدردشة وميزات الخريطة. الإشعارات تعمل لكلا نوعي المصادقة وتُعرض في صفحة الإشعارات داخل التطبيق.

# faqNotificationTypesTitle
source: What types of notifications will I receive?
ar: ما أنواع الإشعارات التي سأتلقاها؟

# faqNotificationTypesAnswer
source: You'll receive notifications for help requests (Google users), chat messages, emergency alerts, and map-related updates. All notifications appear in the in-app notifications page and as push notifications on your device.
ar: ستتلقى إشعارات لطلبات المساعدة (مستخدمو جوجل) ورسائل الدردشة وتنبيهات الطوارئ والتحديثات المتعلقة بالخريطة. جميع الإشعارات تظهر في صفحة الإشعارات داخل التطبيق وكإشعارات فورية على جهازك.

# faqAiAssistantTitle
source: AI Assistant
ar: المساعد الذكي

# faqChatbotTitle
source: How do I interact with the AI chatbot?
ar: كيف أتفاعل مع المساعد الذكي؟

# faqChatbotAnswer
source: Access the AI assistant from the bottom navigation. You can ask questions about car problems, road assistance, or general help. The AI can analyze images you upload and provide relevant advice based on your car details and location.
ar: يمكن الوصول للمساعد الذكي من شريط التنقل السفلي. يمكنك طرح أسئلة حول مشاكل السيارة أو المساعدة على الطريق أو المساعدة العامة. الذكي الاصطناعي يمكنه تحليل الصور التي ترفعها وتقديم نصائح ذات صلة بناءً على تفاصيل سيارتك وموقعك.

# faqImageAnalysisTitle
source: Can the AI analyze images?
ar: هل يمكن للذكي الاصطناعي تحليل الصور؟

# faqImageAnalysisAnswer
source: Yes, you can upload images to the AI assistant for analysis. The AI can identify car problems, damage, or other issues from photos and provide relevant advice or recommendations based on what it sees.
ar: نعم، يمكنك رفع صور للمساعد الذكي للتحليل. الذكي الاصطناعي يمكنه تحديد مشاكل السيارة أو الأضرار أو مشاكل أخرى من الصور وتقديم نصائح أو توصيات ذات صلة بناءً على ما يراه.

# faqSystemFeaturesTitle
source: System Features
ar: ميزات النظام

# faqAppVersionTitle
source: How do I check the app version?
ar: كيف أتحقق من إصدار التطبيق؟

# faqAppVersionAnswer
source: The current app version is displayed on the About page, starting from version 1.0.6. The version automatically increments with new releases and updates.
ar: إصدار التطبيق الحالي معروض في صفحة حول، بدءاً من الإصدار 1.0.6. الإصدار يزيد تلقائياً مع الإصدارات والتحديثات الجديدة.

# faqDataPersistenceTitle
source: How does data caching and persistence work?
ar: كيف يعمل التخزين المؤقت واستمرارية البيانات؟

# faqDataPersistenceAnswer
source: The app saves your data locally to work offline and keep services running smoothly. Profile data, emergency contacts, and settings persist until you explicitly modify them. Login tokens are saved to maintain continuous access for emergency features.
ar: التطبيق يحفظ بياناتك محلياً للعمل دون اتصال والحفاظ على سير الخدمات بسلاسة. بيانات الملف الشخصي وجهات اتصال الطوارئ والإعدادات تستمر حتى تقوم بتعديلها صراحة. رموز تسجيل الدخول تُحفظ للحفاظ على الوصول المستمر لميزات الطوارئ.

# faqLanguageSwitchingTitle
source: How do I change the app language?
ar: كيف أغير لغة التطبيق؟

# faqLanguageSwitchingAnswer
source: Go to Profile settings and select your preferred language (English or Arabic). The app supports RTL layout for Arabic and uses specific Arabic fonts (Tajawal, Cairo Bold, Changa, Almarai) while English uses system fonts.
ar: اذهب إلى إعدادات الملف الشخصي واختر لغتك المفضلة (الإنجليزية أو العربية). التطبيق يدعم تخطيط RTL للعربية ويستخدم خطوط عربية محددة (تجوال، القاهرة بولد، تشانجا، المرعي) بينما الإنجليزية تستخدم خطوط النظام.

# faqDarkModeTitle
source: How do I enable dark mode?
ar: كيف أفعل الوضع الليلي؟

# faqDarkModeAnswer
source: Toggle dark mode on/off in Profile settings. Dark mode changes the app's color scheme to be easier on your eyes in low-light conditions while maintaining all functionality.
ar: بدّل الوضع الليلي تشغيل/إيقاف في إعدادات الملف الشخصي. الوضع الليلي يغير نظام ألوان التطبيق ليكون أسهل على عينيك في ظروف الإضاءة المنخفضة مع الحفاظ على جميع الوظائف.

source: Privacy Policy
ar: سياسة الخصوصية

# privacyPolicyTitle
source: Privacy Policy
ar: سياسة الخصوصية

# privacyLastUpdated
source: Last Updated: May 2025
ar: آخر تحديث: مايو 2025

# privacyIntroduction
source: Road Helper is committed to protecting your privacy and ensuring the security of your personal information. This Privacy Policy explains how we collect, use, store, and protect your data when you use our mobile application.
ar: تطبيق Road Helper ملتزم بحماية خصوصيتك وضمان أمان معلوماتك الشخصية. تشرح سياسة الخصوصية هذه كيفية جمع واستخدام وتخزين وحماية بياناتك عند استخدام تطبيقنا المحمول.

# privacyDataCollectionTitle
source: 1. Data Collection
ar: 1. جمع البيانات

# privacyPersonalInfoTitle
source: Personal Information
ar: المعلومات الشخصية

# privacyPersonalInfoContent
source: We collect the following personal information: • Name and email address (required for account creation) • Phone number (optional, for profile completion) • Vehicle information (car model, color, plate number) • Driver's license images (front and back) • Profile images (optional, uploaded by user choice)
ar: نجمع المعلومات الشخصية التالية: • الاسم والبريد الإلكتروني (مطلوب لإنشاء الحساب) • رقم الهاتف (اختياري، لإكمال الملف الشخصي) • معلومات المركبة (موديل السيارة واللون ورقم اللوحة) • صور رخصة القيادة (الوجه الأمامي والخلفي ) • صور الملف الشخصي (اختيارية، يرفعها المستخدم بإرادته)

# privacyLocationDataTitle
source: Location Data
ar: بيانات الموقع

# privacyLocationDataContent
source: Location data collection varies by authentication method: • Google Sign-In users: Real-time location tracking for map features and help requests (can be disabled in settings) • Traditional users: Location access only when using map features • Emergency services: GPS coordinates are included in SOS messages for safety purposes • All location data is processed locally and shared only with your explicit consent
ar: جمع بيانات الموقع يختلف حسب طريقة المصادقة: • مستخدمو تسجيل الدخول بجوجل: تتبع الموقع في الوقت الفعلي لميزات الخريطة وطلبات المساعدة (يمكن تعطيله في الإعدادات) • المستخدمون التقليديون: الوصول للموقع فقط عند استخدام ميزات الخريطة • خدمات الطوارئ: إحداثيات GPS مدرجة في رسائل SOS لأغراض السلامة • جميع بيانات الموقع تُعالج محلياً وتُشارك فقط بموافقتك الصريحة

# privacyEmergencyContactsTitle
source: Emergency Contacts
ar: جهات اتصال الطوارئ

# privacyEmergencyContactsContent
source: Emergency contact information is stored securely for SOS functionality: • Names, phone numbers, and relationship details • Stored locally on your device and backed up to Firebase • Used exclusively for emergency SMS alerts • Never shared with third parties or used for marketing
ar: معلومات جهات اتصال الطوارئ تُحفظ بأمان لوظيفة SOS: • الأسماء وأرقام الهواتف وتفاصيل العلاقة • تُحفظ محلياً على جهازك ويتم نسخها احتياطياً على Firebase • تُستخدم حصرياً لتنبيهات SMS الطارئة • لا تُشارك أبداً مع أطراف ثالثة أو تُستخدم للتسويق

# privacyDataStorageTitle
source: 2. Data Storage & Security
ar: 2. تخزين البيانات والأمان

# privacyLocalStorageTitle
source: Local Storage
ar: التخزين المحلي

# privacyLocalStorageContent
source: Your data is stored locally on your device using: • SharedPreferences for user preferences and session data • Local caching for profile information and images • Encrypted storage for sensitive authentication tokens • Data persists until you explicitly log out or clear app data
ar: بياناتك تُحفظ محلياً على جهازك باستخدام: • SharedPreferences لتفضيلات المستخدم وبيانات الجلسة • التخزين المؤقت المحلي لمعلومات الملف الشخصي والصور • التخزين المشفر لرموز المصادقة الحساسة • البيانات تستمر حتى تسجل الخروج صراحة أو تمسح بيانات التطبيق

# privacyCloudStorageTitle
source: Cloud Storage
ar: التخزين السحابي

# privacyCloudStorageContent
source: We use secure cloud services for data backup and synchronization: • Firebase Realtime Database for user profiles and help requests • Firebase Authentication for secure login management • Backend API (http://81.10.91.96:8132) for profile data and image storage • All data transmission is encrypted using HTTPS/TLS protocols
ar: نستخدم خدمات سحابية آمنة للنسخ الاحتياطي والمزامنة: • Firebase Realtime Database للملفات الشخصية وطلبات المساعدة • Firebase Authentication لإدارة تسجيل الدخول الآمن • Backend API (http://81.10.91.96:8132) لبيانات الملف الشخصي وتخزين الصور • جميع عمليات نقل البيانات مشفرة باستخدام بروتوكولات HTTPS/TLS

# privacyThirdPartyTitle
source: 3. Third-Party Services
ar: 3. خدمات الأطراف الثالثة

# privacyGoogleServicesTitle
source: Google Services
ar: خدمات جوجل

# privacyGoogleServicesContent
source: We integrate with Google services for enhanced functionality: • Google Sign-In for authentication (optional) • Google Maps for location services and navigation • Google Places API for nearby service discovery • Firebase services for real-time features and notifications • Data shared with Google is governed by Google's Privacy Policy
ar: نتكامل مع خدمات جوجل للحصول على وظائف محسنة: • تسجيل الدخول بجوجل للمصادقة (اختياري) • خرائط جوجل لخدمات الموقع والملاحة • Google Places API لاكتشاف الخدمات القريبة • خدمات Firebase للميزات الفورية والإشعارات • البيانات المشتركة مع جوجل تحكمها سياسة خصوصية جوجل

# privacyNotificationServicesTitle
source: Notification Services
ar: خدمات الإشعارات

# privacyNotificationServicesContent
source: We use Firebase Cloud Messaging (FCM) for push notifications: • Device tokens are stored securely for message delivery • Notifications include help requests, chat messages, and app updates • You can disable notifications in your device settings • No personal content is stored on Google's servers
ar: نستخدم Firebase Cloud Messaging (FCM) للإشعارات الفورية: • رموز الجهاز تُحفظ بأمان لتسليم الرسائل • الإشعارات تشمل طلبات المساعدة ورسائل الدردشة وتحديثات التطبيق • يمكنك تعطيل الإشعارات في إعدادات جهازك • لا يُحفظ محتوى شخصي على خوادم جوجل

# privacySmsServicesTitle
source: SMS Services
ar: خدمات SMS

# privacySmsServicesContent
source: Emergency SOS feature uses device SMS capabilities: • SMS messages are sent directly from your device • No SMS content is stored on our servers • Emergency messages include your location and battery status • SMS functionality requires device permissions for emergency use only
ar: ميزة الطوارئ SOS تستخدم قدرات SMS للجهاز: • رسائل SMS تُرسل مباشرة من جهازك • لا يُحفظ محتوى SMS على خوادمنا • رسائل الطوارئ تشمل موقعك وحالة البطارية • وظيفة SMS تتطلب أذونات الجهاز للاستخدام الطارئ فقط

# privacyDataUsageTitle
source: 4. How We Use Your Data
ar: 4. كيف نستخدم بياناتك

# privacyDataUsageContent
source: Your data is used exclusively for app functionality: • Account management and authentication • Profile customization and vehicle information display • Location-based services and navigation • Help request system (Google users only) • Emergency SOS alerts and safety features • App personalization and preference storage • Technical support and troubleshooting We never use your data for advertising, marketing to third parties, or any purpose not directly related to app functionality.
ar: بياناتك تُستخدم حصرياً لوظائف التطبيق: • إدارة الحساب والمصادقة • تخصيص الملف الشخصي وعرض معلومات المركبة • الخدمات المبنية على الموقع والملاحة • نظام طلبات المساعدة (مستخدمو جوجل فقط) • تنبيهات الطوارئ SOS وميزات السلامة • تخصيص التطبيق وتخزين التفضيلات • الدعم الفني وحل المشاكل نحن لا نستخدم بياناتك أبداً للإعلانات أو التسويق لأطراف ثالثة أو أي غرض غير مرتبط مباشرة بوظائف التطبيق.
